ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR1986VK01/inc/MDR1986VK01_timer.h
/*-- TIMER_IE: Timer Interrupt Enable Register ---------------------*/
/* Bit field positions: */
#define TIMER_IE_CNT_ZERO_EVENT_IE_Pos          0
#define TIMER_IE_CNT_ARR_EVENT_IE_Pos           1
#define TIMER_IE_ETR_RE_EVENT_IE_Pos            2
#define TIMER_IE_ETR_FE_EVENT_IE_Pos            3
#define TIMER_IE_BRK_EVENT_IE_Pos               4
#define TIMER_IE_CCR_CAP_EVENT_IE_Pos           5
#define TIMER_IE_CCR_REF_EVENT_IE_Pos           9
#define TIMER_IE_CCR1_CAP_EVENT_IE_Pos          13

/* Bit field masks: */
#define TIMER_IE_CNT_ZERO_EVENT_IE              ((uint32_t)0x00000001)
#define TIMER_IE_CNT_ARR_EVENT_IE               ((uint32_t)0x00000002)
#define TIMER_IE_ETR_RE_EVENT_IE                ((uint32_t)0x00000004)
#define TIMER_IE_ETR_FE_EVENT_IE                ((uint32_t)0x00000008)
#define TIMER_IE_BRK_EVENT_IE                   ((uint32_t)0x00000010)
#define TIMER_IE_CCR_CAP_EVENT_IE_Msk           ((uint32_t)0x000001E0)
#define TIMER_IE_CCR_REF_EVENT_IE_Msk           ((uint32_t)0x00001E00)
#define TIMER_IE_CCR1_CAP_EVENT_IE_Msk          ((uint32_t)0x0001E000)

/** @} */ /* End of group TIMER_IE */

/** @defgroup TIMER_DMA_RE	TIMER DMA RE
  * @{
  */ 

/*-- TIMER_DMA_RE: Timer DMA Request Enable Register ---------------*/
/* Bit field positions: */
#define TIMER_DMA_RE_CNT_ZERO_EVENT_RE_Pos      0
#define TIMER_DMA_RE_CNT_ARR_EVENT_RE_Pos       1
#define TIMER_DMA_RE_ETR_RE_EVENT_RE_Pos        2
#define TIMER_DMA_RE_ETR_FE_EVENT_RE_Pos        3
#define TIMER_DMA_RE_BRK_EVENT_RE_Pos           4
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_Pos       5
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_Pos       9
#define TIMER_DMA_RE_CCR1_CAP_EVENT_RE_Pos      13

/* Bit field masks: */
#define TIMER_DMA_RE_CNT_ZERO_EVENT_RE          ((uint32_t)0x00000001)
#define TIMER_DMA_RE_CNT_ARR_EVENT_RE           ((uint32_t)0x00000002)
#define TIMER_DMA_RE_ETR_RE_EVENT_RE            ((uint32_t)0x00000004)
#define TIMER_DMA_RE_ETR_FE_EVENT_RE            ((uint32_t)0x00000008)
#define TIMER_DMA_RE_BRK_EVENT_RE               ((uint32_t)0x00000010)
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_Msk       ((uint32_t)0x000001E0)
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_Msk       ((uint32_t)0x00001E00)
#define TIMER_DMA_RE_CCR1_CAP_EVENT_RE_Msk      ((uint32_t)0x0001E000)

/** @} */ /* End of group TIMER_DMA_RE */

/** @defgroup TIMER_CH_CNTRL2	TIMER CH CNTRL2
  * @{
  */ 

/*-- TIMER_CH_CNTRL2: Timer Channel Control2 Register --------------*/
/* Bit field positions: */
#define TIMER_CH_CNTRL2_CHSEL1_Pos              0
#define TIMER_CH_CNTRL2_CCR1_EN_Pos             2
#define TIMER_CH_CNTRL2_CCRRLD_Pos              3

/* Bit field masks: */
#define TIMER_CH_CNTRL2_CHSEL1_Msk              ((uint32_t)0x00000003)
#define TIMER_CH_CNTRL2_CCR1_EN                 ((uint32_t)0x00000004)
#define TIMER_CH_CNTRL2_CCRRLD                  ((uint32_t)0x00000008)

/** @} */ /* End of group TIMER_CH_CNTRL2 */

/** @} */ /* End of group TIMER_Defines */


/** @defgroup TIMER_Exported_Types TIMER Exported Types
* @{
*/

/**
* @brief  TIMER Counter Init structure definition
*/

typedef struct {
	uint32_t TIMER_IniCounter;		/*!< Specifies the initial counter value.
    This parameter can be a number between 0x0000 and 0xFFFFFFFF. */
    
	uint16_t TIMER_Prescaler; 		 /*!< Specifies the prescaler value used to divide the TIMER clock.
    This parameter can be a number between 0x0000 and 0xFFFF.
    CLK = TIMER_CLK/(TIMER_Prescaler + 1) */
    
	uint32_t TIMER_Period;			 /*!< Specifies the period value to be loaded into the
    Auto-Reload Register (ARR) at the next update event.
    This parameter must be a number between 0x0000 and 0xFFFFFFFF.  */
    
	uint16_t TIMER_CounterMode;		 /*!< Specifies the counter mode.
    This parameter can be a value of @ref TIMER_Counter_Mode */
    
	uint16_t TIMER_CounterDirection; /*!< Specifies the counter direction.
    This parameter can be a value of @ref TIMER_Counter_Direction */
    
	uint16_t TIMER_EventSource; 	 /*!< Specifies the Counter Event source.
    This parameter can be a value of @ref TIMER_Event_Source */
    
	uint16_t TIMER_FilterSampling;   /*!< Specifies the filter sampling clock (FDTS).
    This parameter can be a value of @ref TIMER_Filter_Sampling */
    
	uint16_t TIMER_ARR_UpdateMode; 	 /*!< Specifies the Auto-Reload Register (ARR) updating mode.
    This parameter can be a value of @ref TIMER_ARR_Update_Mode */
    
	uint16_t TIMER_ETR_FilterConf; 	 /*!< Specifies the ETR Filter configuration.
    This parameter can be a value of @ref TIMER_FilterConfiguration */
    
	uint16_t TIMER_ETR_Prescaler; 	 /*!< Specifies the ETR Prescaler configuration.
    This parameter can be a value of @ref TIMER_ETR_Prescaler */
    
	uint16_t TIMER_ETR_Polarity; 	 /*!< Specifies the ETR Polarity configuration.
    This parameter can be a value of @ref TIMER_ETR_Polarity */
    
	uint16_t TIMER_BRK_Polarity; 	 /*!< Specifies the BRK Polarity configuration.
    This parameter can be a value of @ref TIMER_BRK_Polarity */
} TIMER_CntInitTypeDef;

/**
* @brief  TIMER Channel Init structure definition
*/

typedef struct
{
    uint16_t TIMER_CH_Number;             /*!< Specifies the TIMER Channel number to be configured.
    This parameter can be a value of @ref TIMER_CH_Number */
    
    uint16_t TIMER_CH_Mode;               /*!< Specifies the TIMER Channel mode.
    This parameter can be a value of @ref TIMER_CH_Mode */
    
    uint16_t TIMER_CH_ETR_Ena;            /*!< Enables or disables ETR.
    This parameter can be a value of FunctionalState */
    
    uint16_t TIMER_CH_ETR_Reset;          /*!< Enables or disables ETR Reset.
    This parameter can be a value of @ref TIMER_CH_ETR_Reset */
    
    uint16_t TIMER_CH_BRK_Reset;          /*!< Enables or disables BRK Reset.
    This parameter can be a value of @ref TIMER_CH_BRK_Reset */
    
    uint16_t TIMER_CH_REF_Format;         /*!< Specifies the REF signal format.
    This parameter can be a value of @ref TIMER_CH_REF_Format */
    
    uint16_t TIMER_CH_Prescaler;          /*!< Specifies the TIMER Channel Prescaler configuration.
    This parameter can be a value of @ref TIMER_CH_Prescaler */
    
    uint16_t TIMER_CH_EventSource;        /*!< Specifies the Channel Event source.
    This parameter can be a value of @ref TIMER_CH_EventSource */
    
    uint16_t TIMER_CH_FilterConf;         /*!< Specifies the TIMER Channel Filter configuration.
    This parameter can be a value of @ref TIMER_FilterConfiguration */
    
    uint16_t TIMER_CH_CCR_UpdateMode;     /*!< Specifies the TIMER CCR, CCR1 update mode.
    This parameter can be a value of @ref TIMER_CH_CCR_Update_Mode */
    
    uint16_t TIMER_CH_CCR1_Ena;           /*!< Enables or disables the CCR1 register.
    This parameter can be a value of FunctionalState */
    
    uint16_t TIMER_CH_CCR1_EventSource;   /*!< Specifies the Channel CCR1 Event source.
    This parameter can be a value of @ref TIMER_CH_CCR1_EventSource */
}TIMER_ChnInitTypeDef;

/**
* @brief  TIMER Channel Output Init structure definition
*/

typedef struct
{
    uint16_t TIMER_CH_Number;             /*!< Specifies the TIMER Channel number to be configured.
    This parameter can be a value of @ref TIMER_CH_Number */
    
    uint16_t TIMER_CH_DirOut_Polarity;    /*!< Specifies the TIMER CHx output polarity.
    This parameter can be a value of @ref TIMER_CH_OUT_Polarity */
    
    uint16_t TIMER_CH_DirOut_Source;      /*!< Specifies the TIMER CHx output source.
    This parameter can be a value of @ref TIMER_CH_OUT_Source */
    
